app/controllers/posts_controller.rb

  def index
    @posts = if params[:query].present?
              Post.search_with_comments(params[:query])
             else
              Post.includes(:comments)
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2, $3)  [["post_id", 1], ["post_id", 2], ["post_id", 3]]
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test"], ["content", "test"], ["created_at", "2025-04-04 23:33:00.848948"], ["updated_at", "2025-04-04 23:33:00.848948"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "Updated Title"], ["content", "Updated content text"], ["updated_at", "2025-04-05 00:16:42.830058"], ["id", 70]]